<!DOCTYPE html>
<html class="no-js">
<head>
    <meta charset="utf-8">
    <title> InfoEM | InfoClasses | Humanas e informática </title>
    <meta name="description" content="">
    <meta name="viewport" content="width=device-width">

    <link rel="stylesheet" href="../../../css/bootstrap.min.css">
    
    <link rel="stylesheet" href="../../../css/font-awesome.min.css">
    
    <link rel="stylesheet" href="../../../css/normalize.min.css">

    <link rel="stylesheet" href="../../../css/templatemo-style.css">

    <script src="../../../js/vendor/modernizr-2.6.2.min.js"></script>

</head>
<body  class="loading">
    <div class="site-header">
        <div class="container">
            <div class="row">
                <nav class="navbar navbar-default navbar-static-top">
                    <div class="navbar-header">
                        <a class="navbar-brand" href="../../index.html">InfoEM</a>
                    </div>
                    <div class="collapse navbar-collapse" id="main-menu">
			<ul class="nav navbar-nav navbar-right">
                            <li><a href="../../../index.html">Home</a></li>
                            <li><a href="../../../infoclasses/infoclasses.html">InfoClasses</a></li>
                            <li><a href="../../../infotrabalho/infotrabalho.html">InfoTrabalho</a></li>
                            <li><a href="../../../infoolimpica/infoolimpica.html">InfoOlimpica</a></li>
                            <li><a href="../../../infoweb/infoweb.html">InfoWEB</a></li>
                            <li><a href="../../../sobre.html">Sobre</a></li>
                            <li><a href="../../../contato.html">Contato</a></li>
                        </ul>
                    </div>
                </nav>         
            </div>
        </div>
    </div>

	<p dir="ltr" style="line-height:1.38;text-align: justify;margin-top:0pt;margin-bottom:0pt;"><span style="font-size:11pt;font-family:Arial;color:#000000;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;">A Revolu&ccedil;&atilde;o Industrial foi o per&iacute;odo de grande desenvolvimento tecnol&oacute;gico que teve in&iacute;cio na Inglaterra a partir da segunda metade do s&eacute;culo XVIII e que se espalhou pelo mundo causando grandes transforma&ccedil;&otilde;es. A Revolu&ccedil;&atilde;o Industrial garantiu o surgimento da ind&uacute;stria e consolidou o processo de forma&ccedil;&atilde;o do capitalismo. Est&aacute; dividido principalmente em tr&ecirc;s per&iacute;odos:&nbsp;</span></p>
<p><br></p>
<p dir="ltr" style="line-height:1.38;text-align: justify;margin-top:0pt;margin-bottom:0pt;"><span style="font-size:11pt;font-family:Arial;color:#000000;background-color:transparent;font-weight:700;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;">-&gt;Primeira Revolu&ccedil;&atilde;o Industrial</span><span style="font-size:11pt;font-family:Arial;color:#000000;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;">&nbsp;corresponde &agrave; primeira fase da Revolu&ccedil;&atilde;o Industrial, per&iacute;odo caracterizado pelo grande desenvolvimento tecnol&oacute;gico iniciado na Europa e que, posteriormente, espalhou-se pelo mundo, provocando in&uacute;meras e profundas transforma&ccedil;&otilde;es econ&ocirc;micas e sociais, iniciou-se por volta de 1760, marcando a transi&ccedil;&atilde;o de um sistema feudal para o sistema capitalista, e durou at&eacute; meados de 1850, foi gerada pela Revolu&ccedil;&atilde;o Comercial que ocorreu na Europa entre os s&eacute;culos XV e meados do s&eacute;culo XVIII. A expans&atilde;o do com&eacute;rcio internacional e o aumento da riqueza permitiram o financiamento do progresso t&eacute;cnico e a instala&ccedil;&atilde;o de ind&uacute;strias. Por essa iniciou-se na Inglaterra em meados do s&eacute;culo XVIII, possui a base tecnol&oacute;gica na m&aacute;quina a vapor e tear mec&acirc;nico. Transporte marcado pelo barco a vapor. As principais marcas est&atilde;o na baixa legisla&ccedil;&atilde;o trabalhista, polui&ccedil;&atilde;o atmosf&eacute;rica e condi&ccedil;&otilde;es insalubres de trabalho. As cidades tinham ind&uacute;strias no centro e enquanto mais perto da ind&uacute;stria mais pobre a &aacute;rea em paralelo, enquanto mais longe mais rico. Por fim, a Primeira Revolu&ccedil;&atilde;o Industrial, ou Primeira fase da Revolu&ccedil;&atilde;o Industrial, representou mudan&ccedil;as da manufatura para a maquinofatura e de um sistema feudal para o sistema capitalista, com luta de classes e intensas diferencia&ccedil;&otilde;es sociais.&nbsp;</span></p>
<p><br></p>
<p dir="ltr" style="line-height:1.38;text-align: justify;margin-top:0pt;margin-bottom:0pt;"><span style="font-size:11pt;font-family:Arial;color:#000000;background-color:transparent;font-weight:700;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;">-&gt;Segunda Revolu&ccedil;&atilde;o Industrial</span><span style="font-size:11pt;font-family:Arial;color:#000000;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;">&nbsp;ocorreu do s&eacute;culo XIX at&eacute; 1970, com poucas mudan&ccedil;as sociais. Principais eventos, marcados pelo surgimento do avi&atilde;o, modelos de produ&ccedil;&atilde;o e produtividade feitos por pesquisas aplicadas. Os principais agentes est&atilde;o nos Estados Unidos com ind&uacute;stria automobil&iacute;stica e Alemanha com ind&uacute;stria petroqu&iacute;mica. A base tecnol&oacute;gica foi o motor a combust&atilde;o interna. A base energ&eacute;tica se deu no petr&oacute;leo e eletricidade. A mat&eacute;ria prima concentrou-se no a&ccedil;o e siderurgia. Comunica&ccedil;&atilde;o tel&eacute;grafo e transporte, marcado pela amplia&ccedil;&atilde;o da ferrovia, barco a motor e autom&oacute;vel. As posi&ccedil;&otilde;es das ind&uacute;strias, seguiam um pr&eacute; posicionamento que &eacute; conhecido como &ldquo;Esquema de tri&acirc;ngulo &oacute;timo de localiza&ccedil;&atilde;o de Weber&rdquo;.&nbsp;</span></p>
<p><br></p>
<p dir="ltr" style="line-height:1.38;text-align: justify;margin-top:0pt;margin-bottom:0pt;"><span style="font-size:11pt;font-family:Arial;color:#000000;background-color:transparent;font-weight:700;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;">-&gt;Terceira Revolu&ccedil;&atilde;o Industrial</span><span style="font-size:11pt;font-family:Arial;color:#000000;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;">&nbsp;marcou mudan&ccedil;as para economia atual e capitalismo financeiro. Marcado pelo MTCI &ndash; Meio t&eacute;cnico cient&iacute;fico informacional. Presen&ccedil;as de tecnopolos onde empresas injetam dinheiro e a universidade pesquisa, por exemplo: Vale do Sil&iacute;cio, que faz chips que armazenam informa&ccedil;&otilde;es. Existem v&aacute;rios centros de pesquisa em infraestrutura de comunica&ccedil;&atilde;o, qu&iacute;mica fina, nanotecnologia, telecomunica&ccedil;&atilde;o -comunica&ccedil;&atilde;o em tempo real e telem&aacute;tica -informa&ccedil;&atilde;o de bem mat&eacute;ria-. Base tecnol&oacute;gica marcada pela microinform&aacute;tica, microchip.&nbsp;</span></p>
<p><br></p>
<p dir="ltr" style="line-height:1.38;text-align: center;margin-top:0pt;margin-bottom:0pt;"><span style="font-size:11pt;font-family:Arial;color:#000000;background-color:transparent;font-weight:700;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;">Mudan&ccedil;a do conceito de tecnologia, atrav&eacute;s dos s&eacute;culos.&nbsp;</span></p>
<p><br></p>
<p dir="ltr" style="line-height:1.38;text-align: justify;margin-top:0pt;margin-bottom:0pt;"><span style="font-size:11pt;font-family:Arial;color:#000000;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;">Por defini&ccedil;&atilde;o, tecnologia &eacute; o conjunto de princ&iacute;pios, m&eacute;todos, instrumentos e processos cientificamente determinados que se aplica especialmente &agrave; atividade industrial, com vistas &agrave; produ&ccedil;&atilde;o de bens mais eficientes e mais baratos. O conceito de tecnologia engloba, portanto, todas as t&eacute;cnicas e seu estudo. Assim, entende-se por inova&ccedil;&atilde;o tecnol&oacute;gica a aplica&ccedil;&atilde;o de qualquer m&eacute;todo ou instrumento, descoberto por meio da pesquisa sistem&aacute;tica, &agrave; coleta, fabrica&ccedil;&atilde;o, armazenamento, transporte etc. de bens, cujos resultados sejam melhores do que os obtidos anteriormente. Desse modo, ao passar dos anos com investimentos, crescimentos te&oacute;ricos e objetivos em diversas &aacute;reas do conhecimento os bens ser&atilde;o vistos de formas distintas. Em computa&ccedil;&atilde;o, o termo computador refere-se a objetos que t&ecirc;m rela&ccedil;&otilde;es alg&eacute;bricas para solu&ccedil;&otilde;es matem&aacute;ticas e de problemas. Hoje se compreende computador, como m&aacute;quinas com v&aacute;rias fun&ccedil;&otilde;es, mas no come&ccedil;o da computa&ccedil;&atilde;o, na Mesopot&acirc;mia Antiga, o &Aacute;baco era conhecido como computador, por resolver problemas matem&aacute;ticos e usar tecnologia da &eacute;poca.&nbsp;</span></p>
<p><br></p>
<p dir="ltr" style="line-height:1.38;text-align: justify;margin-top:0pt;margin-bottom:0pt;"><span style="font-size:11pt;font-family:Arial;color:#000000;background-color:transparent;font-weight:700;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;">Transforma&ccedil;&otilde;es da computa&ccedil;&atilde;o, ao passar dos s&eacute;culos.&nbsp;</span></p>
<p><br></p>
<p dir="ltr" style="line-height:1.38;text-align: justify;margin-top:0pt;margin-bottom:0pt;"><span style="font-size:11pt;font-family:Arial;color:#000000;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;">Com a necessidade de c&aacute;lculos mais complexos, surgiu na Mesopot&acirc;mia por volta de 5000 anos atr&aacute;s, o &Aacute;baco. Ap&oacute;s anos em 1642, Blaise Pascal criou a M&aacute;quina de Pascal que funcionava por rodas e engrenagens e permitia somar e subtrair. Em 161, Gottfried Leibniz, criou outra m&aacute;quina, dessa vez era capaz de somar, subtrair, dividir e multiplicar, mas era feito manualmente. Foi somente em 1801 que Jacquard, criou uma m&aacute;quina baseando-se em tecelagem, controlado por cart&otilde;es perfurados, persistiu at&eacute; meados do s&eacute;culo XX, mas &eacute; usado atualmente em folhas gabarito do enem. Em 1803, Charles Babbage, criou duas m&aacute;quinas, uma que trabalhava com n&uacute;mero decimal e movido a vapor, outra anal&iacute;tica com cart&otilde;es perfurados, Babbage trabalhou junto com Ada Lovelace, ela foi respons&aacute;vel por criar primeiros exemplos de dados funcion&aacute;rios por m&aacute;quinas, infelizmente ela morreu antes de concretizar sua tarefa. Chegando apenas em 1854, George Boole, escreveu &ldquo;Leis do Pensamento&rdquo; onde descreveu &aacute;lgebra Booleana, que se baseia na rela&ccedil;&atilde;o bin&aacute;ria 0, falso, 1, verdadeiro, que &eacute; base dos circuitos digitais atuais. Em 1889, Hollerith criou um cart&atilde;o perfurado para armazenar dados e uma m&aacute;quina para armazenar esses cart&otilde;es. Os computadores como conhecemos hoje, come&ccedil;aram a surgir em 1946, com surgimento de computador a v&aacute;lvulas.</span></p>	

<button> <a href="https://drive.google.com/file/d/1kfhImHAW7Jd_TWcauqJDuvVxv2GsAo3Z/view?usp=sharing" > <h2> Exercite seus conhecimentos </h2> </a> </button> 
<button> <a href="../humanasinfo.html"> <h2> Volte para estudar novos conteúdos </h2> </a> </button>

    <div class="fourth-section"  style="margin-top: 10px;">
        <div class="container">
            <div class="row">
                <div class="col-md-12 text-center">
                    <h2>QUER AJUDAR A FAZER UMA NOVA INFOEM ?</h2>
                    <a href="../../contato.html">ENTRE EM CONTATO !</a>
                </div>
            </div>
        </div>
    </div>

    

    <footer class="site-footer">
        <div class="container">
            <div class="row">
                <div class="col-md-12 text-center">
                    <p>Assinado &copy; InfoEM</p>
                </div>
            </div>
        </div>
    </footer>

    <script src="../../../js/vendor/jquery-1.10.1.min.js"></script>
    <script src="../../../js/bootstrap.min.js"></script>
    <script src="../../../js/plugins.js"></script>
    <script src="../../../js/main.js"></script>    
    
</body>
</html>