<!DOCTYPE html>
<html class="no-js">
<head>
    <meta charset="utf-8">
    <title> InfoEM | InfoClasses | Naturais e computação </title>
    <meta name="description" content="">
    <meta name="viewport" content="width=device-width">

    <link rel="stylesheet" href="../../../css/bootstrap.min.css">
    
    <link rel="stylesheet" href="../../../css/font-awesome.min.css">
    
    <link rel="stylesheet" href="../../../css/normalize.min.css">

    <link rel="stylesheet" href="../../../css/templatemo-style.css">

    <script src="../../../js/vendor/modernizr-2.6.2.min.js"></script>

</head>
<body  class="loading">
    <div class="site-header">
        <div class="container">
            <div class="row">
                <nav class="navbar navbar-default navbar-static-top">
                    <div class="navbar-header">
                        <a class="navbar-brand" href="../../index.html">InfoEM</a>
                    </div>
                    <div class="collapse navbar-collapse" id="main-menu">
			<ul class="nav navbar-nav navbar-right">
                            <li><a href="../../../index.html">Home</a></li>
                            <li><a href="../../../infoclasses/infoclasses.html">InfoClasses</a></li>
                            <li><a href="../../../infotrabalho/infotrabalho.html">InfoTrabalho</a></li>
                            <li><a href="../../../infoolimpica/infoolimpica.html">InfoOlimpica</a></li>
                            <li><a href="../../../infoweb/infoweb.html">InfoWEB</a></li>
                            <li><a href="../../../sobre.html">Sobre</a></li>
                            <li><a href="../../../contato.html">Contato</a></li>
                        </ul>
                    </div>
                </nav>         
            </div>
        </div>
    </div>

<p><strong>O que &eacute; eletricidade e o que ela estuda?&nbsp;</strong></p>
<p>&nbsp;</p>
<p><span style="font-weight: 400;">Eletricidade &eacute; o ramo da f&iacute;sica que se dedica a estudar fen&ocirc;menos originados a partir do fluxo de cargas el&eacute;tricas, como eletrocin&eacute;tica, eletrost&aacute;tica, e eletromagnetismo. Como exemplos desses fen&ocirc;menos podemos citar a eletricidade est&aacute;tica, rel&acirc;mpagos, corrente el&eacute;trica, entre outros.&nbsp;</span></p>
<p><span style="font-weight: 400;">&Eacute;, em termos gerais, a &aacute;rea da F&iacute;sica que estuda os fen&ocirc;menos causados pelo trabalho das cargas el&eacute;tricas.&nbsp;</span></p>
<p>&nbsp;</p>
<p><strong>T&oacute;picos importantes que devem ser lembrados.&nbsp;</strong></p>
<p>&nbsp;</p>
<p><span style="font-weight: 400;">Muitas coisas, existem dentro deste ramo t&atilde;o abrangente que a eletricidade se prop&otilde;e a estudar, mas iremos nos prender a alguns conceitos fundamentais:&nbsp;</span></p>
<p>&nbsp;</p>
<p><span style="font-weight: 400;">1-El&eacute;tron &eacute; a part&iacute;cula que torna a eletricidade poss&iacute;vel;&nbsp;</span></p>
<p><span style="font-weight: 400;">2-Elementos condutores e isolantes;</span></p>
<p><span style="font-weight: 400;">3-Corrente el&eacute;trica &eacute; a quantidade de el&eacute;trons que passa em um determinado tempo por um fio ou um condutor;&nbsp;</span></p>
<p><span style="font-weight: 400;">4-Efeito Joule (efeito t&eacute;rmico) a transforma&ccedil;&atilde;o da eletricidade (movimento dos el&eacute;trons) em calor.&nbsp;</span></p>
<p>&nbsp;</p>
<p><strong>Como funciona o computador?&nbsp;</strong></p>
<p>&nbsp;</p>
<p><span style="font-weight: 400;">A arquitetura b&aacute;sica de qualquer computador completo, seja um PC, um Macintosh ou mesmo um computador de grande porte, &eacute; formada por apenas 5 componentes b&aacute;sicos: processador, mem&oacute;ria RAM, disco r&iacute;gido, dispositivos de entrada e sa&iacute;da e softwares.&nbsp;</span></p>
<p>&nbsp;</p>
<p><span style="font-weight: 400;">O processador &eacute; o c&eacute;rebro do sistema, encarregado de processar todas as informa&ccedil;&otilde;es. Por&eacute;m, apesar de toda sua sofistica&ccedil;&atilde;o, o processador n&atilde;o pode fazer nada sozinho. Para termos um computador funcional, precisamos de mais alguns componentes de apoio: mem&oacute;ria, unidades de disco, dispositivos de entrada e sa&iacute;da e finalmente, os programas a serem executados.&nbsp;</span></p>
<p>&nbsp;</p>
<p><span style="font-weight: 400;">A mem&oacute;ria principal, ou mem&oacute;ria RAM, &eacute; usada pelo processador para armazenar os dados que est&atilde;o sendo processados, funcionando como uma esp&eacute;cie de mesa de trabalho. A quantidade de mem&oacute;ria RAM dispon&iacute;vel, determina quais atividades o processador poder&aacute; executar. Um engenheiro n&atilde;o pode desenhar a planta de um edif&iacute;cio sobre uma carteira de escola.&nbsp;</span></p>
<p><span style="font-weight: 400;">O principal dispositivo de mem&oacute;ria de massa &eacute; o disco r&iacute;gido, onde ficam guardados programas e dados enquanto n&atilde;o est&atilde;o em uso ou quando o micro &eacute; desligado. Disquetes e CD-ROMs tamb&eacute;m s&atilde;o ilustres representantes desta categoria de mem&oacute;ria. Uma d&uacute;vida que atinge muita gente.&nbsp;</span></p>
<p>&nbsp;</p>
<p><strong>Quais s&atilde;o os componentes principais do computador? Para que servem?&nbsp;</strong></p>
<p>&nbsp;</p>
<p><span style="font-weight: 400;">Um computador &eacute; formado por componentes importantes para seu correto funcionamento. Sem um deles, o PC pode at&eacute; n&atilde;o ligar. S&atilde;o eles: Dispositivo de Armazenamento &ndash; Conhecidos como HD ou disco r&iacute;gido, &eacute; o respons&aacute;vel por armazenar todos os dados do computador. &Eacute; onde fica instalado o sistema operacional, programas, jogos e outros arquivos (m&uacute;sica, v&iacute;deos e fotos). At&eacute; o momento existem mais dois tipos de armazenamento: o SSHD (chamado tamb&eacute;m de H&iacute;brido) e o SSD. Hard Disk Processador &ndash; Conhecido tamb&eacute;m como CPU (Central Processing Unit &ndash; Unidade Central de Processamento), &eacute; o respons&aacute;vel pela leitura de todos os dados do computador. Tudo o que est&aacute; acontecendo em sua tela &eacute; o processador quem est&aacute; lendo os dados.&nbsp;</span></p>
<p><span style="font-weight: 400;">Desde a inicializa&ccedil;&atilde;o do sistema operacional at&eacute; a execu&ccedil;&atilde;o de um programa &eacute; o processador quem est&aacute; fazendo processadores Mem&oacute;ria RAM &ndash; A mem&oacute;ria RAM (Random Access Memory &ndash; Mem&oacute;ria de acesso aleat&oacute;rio) serve para armazenar dados de programas enquanto eles s&atilde;o executados. &Eacute; a respons&aacute;vel por fazer uma &ldquo;ponte&rdquo; entre o dispositivo de armazenamento (HD, SSHD ou SSD) e o processador. Sem a mem&oacute;ria RAM, o processador teria o trabalho extra de buscar os dados no armazenamento e ter que os ler ao mesmo tempo. RAM Placa-m&atilde;e &ndash; &Eacute; a respons&aacute;vel por interligar todos os componentes principais do computador.&nbsp;</span></p>
<p><span style="font-weight: 400;">&Eacute; nela que est&aacute; o processador, a mem&oacute;ria RAM e a liga&ccedil;&atilde;o com o armazenamento. Al&eacute;m de interligar todos esses componentes, &eacute; nela que conectamos o teclado, mouse, monitor, pen drive, cabo da internet e sa&iacute;da de som. Placa-M&atilde;e Fonte &ndash; Para todos os componentes funcionarem, precisa de energia. A fonte alimenta a placa-m&atilde;e, o dispositivo de armazenamento e outros componentes (que n&atilde;o s&atilde;o t&atilde;o &uacute;teis para alguns usu&aacute;rios). Fonte Gabinete &ndash; &Eacute; o esqueleto, a carca&ccedil;a que ir&aacute; manter todas as pe&ccedil;as fixas. Prendemos em um gabinete a placa-m&atilde;e, o dispositivo de armazenamento, a fonte, etc. Gabinete Temos tamb&eacute;m outros acess&oacute;rios, que talvez n&atilde;o sejam t&atilde;o importantes ou &uacute;teis para alguns usu&aacute;rios. S&atilde;o eles:&nbsp;</span></p>
<p>&nbsp;</p>
<p><span style="font-weight: 400;">Leitor de m&iacute;dia f&iacute;sica &ndash; Chamado tamb&eacute;m de driver de CD/DVD/Bluray, &eacute; o respons&aacute;vel por ler os dados armazenados em m&iacute;dias f&iacute;sicas. Hoje com o avan&ccedil;o da m&iacute;dia digital, os discos n&atilde;o est&atilde;o sendo mais t&atilde;o comercializados (como &eacute; o caso de CDs de m&uacute;sica). driver&nbsp;</span></p>
<p>&nbsp;</p>
<p><span style="font-weight: 400;">Estabilizador &ndash; Um dos componentes mais controversos que existe em um PC. Alguns usu&aacute;rios utilizam e outros n&atilde;o. Em geral ele serve para alimentar a energia do computador, equilibrando a voltagem que vem da tomada (utilizado para prevenir oscila&ccedil;&atilde;o de energia na rede el&eacute;trica).&nbsp;</span></p>
<p>&nbsp;</p>
<p><span style="font-weight: 400;">Placa de v&iacute;deo 3D &ndash; Hoje em dia chamada tamb&eacute;m de PCI Express, placa VGA ou GPU (Graphics Processing Unit &ndash; Unidade de Processamento Gr&aacute;fico), &eacute; a respons&aacute;vel pela renderiza&ccedil;&atilde;o de imagens em 3D. Um computador pode funcionar sem ela para visualizar fotos, v&iacute;deos, navegar pela internet e rodar alguns programas.&nbsp;</span></p>
<p>&nbsp;</p>
<p><span style="font-weight: 400;">A Placa-m&atilde;e j&aacute; vem com um chip gr&aacute;fico para executar tarefas mais simples, mas para jogos e programas mais pesados &eacute; obrigat&oacute;rio ter uma placa de v&iacute;deo 3D. placa 3d Nobreak &ndash; Um acess&oacute;rio importante para qualquer computador (empresas principalmente). Ele funciona como uma bateria gigante que alimenta o computador quando tem quedas de energia. Ele ajuda a evitar falhas t&eacute;cnicas dos componentes principais do PC (HD, processador, placa-m&atilde;e) devido a varia&ccedil;&atilde;o de energia na rede el&eacute;trica. Muitos usu&aacute;rios n&atilde;o o utilizam pelo seu pre&ccedil;o e por achar que o estabilizador se encarrega de &ldquo;segurar a energia&rdquo;.</span></p>

<button> <a href="https://drive.google.com/file/d/1H8-IgF3bEudWGXrv_KlzJyVP400a6hqk/view?usp=sharing" > <h3> Exercite seus conhecimentos </h3> </a> </button> 
<button> <a href="../naturaisinfo.html"> <h3> Volte para estudar novos conteúdos </h3> </a> </button> 

<div class="fourth-section"  style="margin-top: 10px;">
    <div class="container">
        <div class="row">
            <div class="col-md-12 text-center">
                <h2>QUER AJUDAR A FAZER UMA NOVA INFOEM ?</h2>
                <a href="../../contato.html">ENTRE EM CONTATO !</a>
            </div>
        </div>
    </div>
</div>



<footer class="site-footer">
    <div class="container">
        <div class="row">
            <div class="col-md-12 text-center">
                <p>Assinado &copy; InfoEM</p>
            </div>
        </div>
    </div>
</footer>

<script src="../../../js/vendor/jquery-1.10.1.min.js"></script>
<script src="../../../js/bootstrap.min.js"></script>
<script src="../../../js/plugins.js"></script>
<script src="../../../js/main.js"></script>    

</body>
</html>