<!DOCTYPE html>
<html class="no-js">
<head>
    <meta charset="utf-8">
    <title> InfoEM | InfoClasses | Naturais e computação </title>
    <meta name="description" content="">
    <meta name="viewport" content="width=device-width">

    <link rel="stylesheet" href="../../../css/bootstrap.min.css">
    
    <link rel="stylesheet" href="../../../css/font-awesome.min.css">
    
    <link rel="stylesheet" href="../../../css/normalize.min.css">

    <link rel="stylesheet" href="../../../css/templatemo-style.css">

    <script src="../../../js/vendor/modernizr-2.6.2.min.js"></script>

</head>
<body  class="loading">
    <div class="site-header">
        <div class="container">
            <div class="row">
                <nav class="navbar navbar-default navbar-static-top">
                    <div class="navbar-header">
                        <a class="navbar-brand" href="../../index.html">InfoEM</a>
                    </div>
                    <div class="collapse navbar-collapse" id="main-menu">
			<ul class="nav navbar-nav navbar-right">
                            <li><a href="../../../index.html">Home</a></li>
                            <li><a href="../../../infoclasses/infoclasses.html">InfoClasses</a></li>
                            <li><a href="../../../infotrabalho/infotrabalho.html">InfoTrabalho</a></li>
                            <li><a href="../../../infoolimpica/infoolimpica.html">InfoOlimpica</a></li>
                            <li><a href="../../../infoweb/infoweb.html">InfoWEB</a></li>
                            <li><a href="../../../sobre.html">Sobre</a></li>
                            <li><a href="../../../contato.html">Contato</a></li>
                        </ul>
                    </div>
                </nav>         
            </div>
        </div>
    </div>

<p><strong>O que s&atilde;o nota&ccedil;&otilde;es cient&iacute;ficas?&nbsp;</strong></p>
<p>&nbsp;</p>
<p><span style="font-weight: 400;">A nota&ccedil;&atilde;o cient&iacute;fica &eacute; uma forma de escrever n&uacute;meros usando a pot&ecirc;ncia de 10.&nbsp;</span></p>
<p><span style="font-weight: 400;">&Eacute; utilizada para reduzir a escrita de n&uacute;meros que apresentam muitos algarismos, sejam eles muito pequenos ou muito grandes s&atilde;o frequentemente encontrados nas ci&ecirc;ncias em geral e escrever em nota&ccedil;&atilde;o cient&iacute;fica facilita fazer compara&ccedil;&otilde;es e c&aacute;lculos. Dito de outro modo, a nota&ccedil;&atilde;o cient&iacute;fica &eacute; uma ferramenta bastante utilizada n&atilde;o s&oacute; na Matem&aacute;tica, mas tamb&eacute;m na F&iacute;sica e Qu&iacute;mica.&nbsp;</span></p>
<p><span style="font-weight: 400;">Ela nos permite escrever e operar n&uacute;meros que, quando escritos em sua forma original, exigem grande paci&ecirc;ncia e esfor&ccedil;o, j&aacute; que, ou s&atilde;o n&uacute;meros muito grandes, ou muito pequenos. Imagine, por exemplo, voc&ecirc; escrevendo a dist&acirc;ncia entre o planeta Terra e o Sol em quil&ocirc;metros ou escrevendo a carga de um pr&oacute;ton em coulomb.&nbsp;</span></p>
<p>&nbsp;</p>
<p><strong>O que s&atilde;o codifica&ccedil;&otilde;es bin&aacute;rias?&nbsp;</strong></p>
<p>&nbsp;</p>
<p><span style="font-weight: 400;">Uma codifica&ccedil;&atilde;o bin&aacute;ria, &eacute; toda forma de escrever um conjunto de informa&ccedil;&otilde;es se baseando em duas vertentes, ou seja, pode ser Verdadeiro e Falso, Sim e N&atilde;o, 0 e 1&hellip; Codifica&ccedil;&atilde;o bin&aacute;ria na computa&ccedil;&atilde;o.&nbsp;</span></p>
<p><span style="font-weight: 400;">No final dos anos 1930, Claude Shannon mostrou que com o uso de interruptores (switches) fechados para verdadeiro e abertos para falso, &eacute; poss&iacute;vel efetuar opera&ccedil;&otilde;es l&oacute;gicas associando o n&uacute;mero 1 para &lsquo;verdadeiro&rsquo; e 0 para &lsquo;falso&rsquo;. Esta codifica&ccedil;&atilde;o da informa&ccedil;&atilde;o &eacute; chamada de base bin&aacute;ria e &eacute; com ela que funcionam os computadores. Ela consiste em utilizar dois status (representados pelos n&uacute;meros 0 e 1) para codificar as informa&ccedil;&otilde;es. Desde os anos 2000 AC, o homem tem calculado com 10 d&iacute;gitos (0, 1, 2, 3, 4, 5, 6, 7, 8, 9), o que chamamos de sistema decimal (ou base 10).&nbsp;</span></p>
<p><span style="font-weight: 400;">No entanto, civiliza&ccedil;&otilde;es antigas e certas aplica&ccedil;&otilde;es atuais utilizam outras bases de c&aacute;lculo, como a base hexadecimal (base 60), criada pelos sum&eacute;rios e que hoje se usa no sistema de horas, minutos e segundos atual.&nbsp;</span></p>
<p><span style="font-weight: 400;">Tamb&eacute;m h&aacute; a base vigesimal (20), utilizada pelos maias, a base duodecimal (12), utilizada pelos anglo-sax&otilde;es nos seus sistemas monet&aacute;rios at&eacute; 1960 e que perdura em parte no sistema de horas de alguns pa&iacute;ses; a base quin&aacute;ria (5), tamb&eacute;m dos maias; e a base bin&aacute;ria (2), utilizada pelo conjunto das tecnologias digitais. O termo bit (com &lsquo;b&rsquo; min&uacute;sculo) significa binary digit, ou seja, 0 ou 1 em codifica&ccedil;&atilde;o bin&aacute;ria. Trata-se da menor unidade de informa&ccedil;&atilde;o manipul&aacute;vel por uma m&aacute;quina digital.&nbsp;</span></p>
<p><span style="font-weight: 400;">&Eacute; poss&iacute;vel representar fisicamente esta informa&ccedil;&atilde;o bin&aacute;ria por um sinal el&eacute;trico ou magn&eacute;tico, que, al&eacute;m de certo patamar, corresponde ao valor 1, por asperezas geom&eacute;tricas em uma superf&iacute;cie e gra&ccedil;as aos bits est&aacute;veis, ou seja, componentes eletr&ocirc;nicos que t&ecirc;m dois estados est&aacute;veis (um corresponde ao estado 1 e o outro ao 0).&nbsp;</span></p>
<p><span style="font-weight: 400;">A combina&ccedil;&atilde;o bin&aacute;ria &eacute; para um computador, algo semelhante a nota&ccedil;&atilde;o cient&iacute;fica para as ci&ecirc;ncias, a diferen&ccedil;a &eacute; que um computador por si s&oacute; n&atilde;o toma decis&otilde;es sozinhos, ent&atilde;o se faz necess&aacute;ria uma codifica&ccedil;&atilde;o compreens&iacute;vel para a m&aacute;quina/computador.</span></p>

<button> <a href="https://drive.google.com/file/d/1H8-IgF3bEudWGXrv_KlzJyVP400a6hqk/view?usp=sharing" > <h3> Exercite seus conhecimentos </h3> </a> </button> 
<button> <a href="../naturaisinfo.html"> <h3> Volte para estudar novos conteúdos </h3> </a> </button>

<div class="fourth-section"  style="margin-top: 10px;">
    <div class="container">
        <div class="row">
            <div class="col-md-12 text-center">
                <h2>QUER AJUDAR A FAZER UMA NOVA INFOEM ?</h2>
                <a href="../../contato.html">ENTRE EM CONTATO !</a>
            </div>
        </div>
    </div>
</div>



<footer class="site-footer">
    <div class="container">
        <div class="row">
            <div class="col-md-12 text-center">
                <p>Assinado &copy; InfoEM</p>
            </div>
        </div>
    </div>
</footer>

<script src="../../../js/vendor/jquery-1.10.1.min.js"></script>
<script src="../../../js/bootstrap.min.js"></script>
<script src="../../../js/plugins.js"></script>
<script src="../../../js/main.js"></script>    

</body>
</html>