<!DOCTYPE html>
<html class="no-js">
<head>
    <meta charset="utf-8">
    <title> InfoEM | InfoClasses | Naturais e computação </title>
    <meta name="description" content="">
    <meta name="viewport" content="width=device-width">

    <link rel="stylesheet" href="../../../css/bootstrap.min.css">
    
    <link rel="stylesheet" href="../../../css/font-awesome.min.css">
    
    <link rel="stylesheet" href="../../../css/normalize.min.css">

    <link rel="stylesheet" href="../../../css/templatemo-style.css">

    <script src="../../../js/vendor/modernizr-2.6.2.min.js"></script>

</head>
<body  class="loading">
    <div class="site-header">
        <div class="container">
            <div class="row">
                <nav class="navbar navbar-default navbar-static-top">
                    <div class="navbar-header">
                        <a class="navbar-brand" href="../../index.html">InfoEM</a>
                    </div>
                    <div class="collapse navbar-collapse" id="main-menu">
			<ul class="nav navbar-nav navbar-right">
                            <li><a href="../../../index.html">Home</a></li>
                            <li><a href="../../../infoclasses/infoclasses.html">InfoClasses</a></li>
                            <li><a href="../../../infotrabalho/infotrabalho.html">InfoTrabalho</a></li>
                            <li><a href="../../../infoolimpica/infoolimpica.html">InfoOlimpica</a></li>
                            <li><a href="../../../infoweb/infoweb.html">InfoWEB</a></li>
                            <li><a href="../../../sobre.html">Sobre</a></li>
                            <li><a href="../../../contato.html">Contato</a></li>
                        </ul>
                    </div>
                </nav>         
            </div>
        </div>
    </div>


<p><strong>Principais teorias f&iacute;sico-matem&aacute;ticas.&nbsp;</strong></p>
<p>&nbsp;</p>
<p><span style="font-weight: 400;">As leis da f&iacute;sica, seja de Newton ou de eletrodin&acirc;mica, se fundam em teorias, as teorias f&iacute;sicas s&atilde;o as que sustentam os universos da f&iacute;sica e da matem&aacute;tica, tornando-as quem elas s&atilde;o hoje. Dentre elas, podemos citar mec&acirc;nica, que estuda o movimento, eletricidade que estuda o movimento das cargas, postulados sobre as rela&ccedil;&otilde;es matem&aacute;ticas, a &aacute;rea da geometria. Todas elas v&atilde;o atuar na inform&aacute;tica de alguma forma e permitindo a evolu&ccedil;&atilde;o de computadores. Principais eventos da evolu&ccedil;&atilde;o do computador.&nbsp;</span></p>
<p>&nbsp;</p>
<p><span style="font-weight: 400;">O computador surgiu na Mesopot&acirc;mia, com o &Aacute;baco. Mas ele precisou evoluir bastante para chegar ao que &eacute; hoje, existiram diversas tentativas para crescimento da computa&ccedil;&atilde;o, iremos nos prender aos eventos que foram substancialmente importantes para a inform&aacute;tica que temos hoje. Os computadores como conhecemos hoje iniciou-se em 1946.&nbsp;</span></p>
<p>&nbsp;</p>
<p><span style="font-weight: 400;">A seguir traremos a evolu&ccedil;&atilde;o cronol&oacute;gica dos computadores:&nbsp;</span></p>
<p>&nbsp;</p>
<p><span style="font-weight: 400;">-&gt;1946: &eacute; anunciada a cria&ccedil;&atilde;o do primeiro computador digital eletr&ocirc;nico de grande escala do mundo, o ENIAC (Electrical Numerical Integrator and Calculator).</span></p>
<p>&nbsp;</p>
<p><span style="font-weight: 400;">&nbsp;-&gt;1951 a 1959: surgem os computadores de primeira gera&ccedil;&atilde;o. Esses eram capazes de calcular com uma velocidade de mil&eacute;simos de segundo, al&eacute;m de serem programados em linguagem de m&aacute;quina.&nbsp;</span></p>
<p>&nbsp;</p>
<p><span style="font-weight: 400;">-&gt;1959 a 1965: surgem os computadores de segunda gera&ccedil;&atilde;o, com capacidade de calcular com uma velocidade de microssegundos, sendo programados em linguagem montadora.&nbsp;</span></p>
<p>&nbsp;</p>
<p><span style="font-weight: 400;">-&gt;1965 a 1975: nascem os computadores da terceira gera&ccedil;&atilde;o. Esses computadores passam a ter diversos componentes miniaturizados e montados em um &uacute;nico CHIP, sendo capazes de calcular em nanossegundos, com uma linguagem de programa&ccedil;&atilde;o de alto n&iacute;vel, orientada para os procedimentos.&nbsp;</span></p>
<p>&nbsp;</p>
<p><span style="font-weight: 400;">-&gt;1975 a 1981: s&atilde;o criados os computadores da quarta gera&ccedil;&atilde;o. Seguindo a tend&ecirc;ncia da terceira gera&ccedil;&atilde;o de miniaturiza&ccedil;&atilde;o de seus componentes e o aperfei&ccedil;oamento dos seus Circuitos Integrados (CI). As linguagens utilizadas nessa gera&ccedil;&atilde;o eram de alt&iacute;ssimo n&iacute;vel, orientada para um problema.</span></p>
<p>&nbsp;</p>
<p><span style="font-weight: 400;">-&gt;1990: a partir dessa d&eacute;cada s&atilde;o lan&ccedil;ados softwares de melhor qualidade e com capacidade de processar as informa&ccedil;&otilde;es com maior rapidez.&nbsp;</span></p>
<p>&nbsp;</p>
<p><span style="font-weight: 400;">-&gt;2000: ap&oacute;s a virada do mil&ecirc;nio os computadores continuaram a seguir a tend&ecirc;ncia de miniaturiza&ccedil;&atilde;o de seus componentes e, tornando dessa forma os computadores mais male&aacute;veis e pr&aacute;ticos nas tarefas di&aacute;rias. Al&eacute;m disso, h&aacute; um investimento maci&ccedil;o em seu design.</span></p>

<button> <a href="https://drive.google.com/file/d/1H8-IgF3bEudWGXrv_KlzJyVP400a6hqk/view?usp=sharing" > <h3> Exercite seus conhecimentos </h3> </a> </button> 
<button> <a href="../naturaisinfo.html"> <h3> Volte para estudar novos conteúdos </h3> </a> </button>

<div class="fourth-section"  style="margin-top: 10px;">
    <div class="container">
        <div class="row">
            <div class="col-md-12 text-center">
                <h2>QUER AJUDAR A FAZER UMA NOVA INFOEM ?</h2>
                <a href="../../contato.html">ENTRE EM CONTATO !</a>
            </div>
        </div>
    </div>
</div>



<footer class="site-footer">
    <div class="container">
        <div class="row">
            <div class="col-md-12 text-center">
                <p>Assinado &copy; InfoEM</p>
            </div>
        </div>
    </div>
</footer>

<script src="../../../js/vendor/jquery-1.10.1.min.js"></script>
<script src="../../../js/bootstrap.min.js"></script>
<script src="../../../js/plugins.js"></script>
<script src="../../../js/main.js"></script>    

</body>
</html>